# 算數運數子，變數的四則運算 ＋- * /
a = 10
b = 5
print("a + b = ", a + b)
print("a - b = ", a - b)
print("a * b = ", a * b)
print("a / b = ", a / b)

# 依據先乘除後加減, 建議好的寫法還是把優先處理的加括號
a = 10
b = 5
c = 7

print("a * b + c = ", a + (b * c))
print("a * b + c = ", a + (b * c))

# 除數
print("a / b = ", a / b)

# // 向下取得除數後的整數
a = 10
b = 5
print("a // b = ", a // b)

a = 12
b = 5
print("a // b = ", a // b)  # 正常邏輯是 2.4

# % 取餘數
a = 10
b = 5
print("a % b = ", a % b)

# 餘數的運用，判定是否為倍數，例如找奇數或偶數
a = 3
print("a % 2 = ", a % 2)
a = 4
print("a % 2 = ", a % 2)

# 請找出下列何者為 3 的倍數，1， 7， 9， 11， 12， 15， 19， 20， 21， 35
a = 3
for i in [1, 7, 9, 11, 12, 15, 19, 20, 21, 35]:
    if i % 3 == 0:
        print(i, end=" ")

print("\n")
# * 乘法和次方 **
a = 2
print("a * 10 = ", a * 10)
print("a ** 2 = ", a ** 2)
print("a ** 3 = ", a ** 3)

# -----------------------------------------------
#複合型態運算子 += -= *= /= %=  //=
a = 100
# a += 10 -> a = a + 10
a += 10
print("a += 10, a = ", a)

# a -= 10 -> a = a - 10
a = 100
a -= 10
print("a -= 10, a = ", a)

# a *= 10 -> a = a * 10
a = 100
a *= 10
print("a *= 10, a = ", a)

# a /= 10 -> a = a / 10
a = 100
a *= 10
print("a /= 10, a = ", a)

# a //= 10 -> a = a // 10
a = 100
a //= 10
print("a //= 10, a = ", a)

# a %= 10 -> a = a % 10
a = 100
a %= 10
print("a %= 10, a = ", a)

# -----------------------------------------------
# 比較運算子 > < == >= <=
a = 10
b = 5
print("a > b : ", a > b)
print("a < b : ", a < b)
print("a == b : ", a == b)

a = 10
b = 10
print("a >= b : ", a >= b)
print("a <= b : ", a <= b)

# -----------------------------------------------
# 遝輯運算子 & and ,  | or , not (負負得正)
a = True
b = True
c = False
print("a & b : ", a & b, a and b)
print("a | c : ", a | c, a or c)
print("not a : ", not a)
print("not c : ", not c)

#實際運用案例
#例如判定學生考試各科都等格，例如考國文和英文兩科，當國文大於 60 和英文大於 60
a = 90
b = 60
print("a >= 60 and b >= 60 : ", a >= 60 and b >= 60)
#例如判定學生考試至少有一科及格，例如考國文和英文兩科，當國文大於 60 和英文小於 60
a = 60
b = 34
print("a >= 60 ｜ b >= 60 : ", a >= 60 or b >= 60)

# 位元運算了 & ｜ ^ ~ >> <<
# & 二進位數字相同部分，不同的部分以0 取代。
#｜位元 或，二進位只要有一個為 1的部分都為 1。
# ^	互斥，二進位相同的部分都為0，不同的部分以1取代。
# ~	相反，二進位 0->1，1->0
# >> 右移，將二進位數字往右移動指定位數，左側補 0, 每移一位，除2
# << 左移，將二進位數字往左移動指定位數，右側補 0， 每移一位，乘2

# 4 -> 0100, 5 -> 0101
print(4&5)
print(4|5)
print(4^5)
print(~4)
print(4>>1)
print(4<<1)


